
# 1) რა არის debuging -ი ახსენი კომენტარებით

# 2) პითონში რა არის input -ის საწყისი data type? და კოდის მეშვეობით დაწერე საიდან გამომდინარე შეგვიძლია მივხვდეთ 

# 3) დახაზე როგორ იქმნება ცვლადი დეტალურად

# 4) რა არის casting დაწერე კომენტარებით

# --------------------------------------------------------------------------------------------------------

# 1. debuging -ი არის პროცესი რომ იპოვო შეცდომები და ერორები

# 2.პითონში ინფუთის საწყისი დათა ტაიპი არის სტრინგი
print(type())
#ტერმინალს როდესაც გავხსნით კლასს გვეტყვის სტრინგს

# 4. casting ი არის როცა ერთი კლასიდან სხვა კლასში გადაიყვან მაგალითად სტრინგს თუ ინტეჯერში გადავიყვანთ