
count = 0
while count < 3:
    print("Hello")
    count += 1

#---------------------------------------------

random_number = 1
while random_number < 4:
    print(random_number)
    random_number += 1

#---------------------------------------------

# ??? ვერ გავიგე როგორ გამეკეთებინა. მგონი ეს არ გვისწავლია

#---------------------------------------------
print()
print()
#---------------------------------------------

hi = 1
while hi < 6:
    print(hi)
    hi += 1

#---------------------------------------------

# while loop გამოიყენება როდესაც არ ვიცით რამდენჯერ უნდა გამეორდეს მაგრამ ასევე შეიძლება რამდენჯერ უნდა გამეორდეს ვიცოდეთ და მაინც დავპრინტოთ
# while loop გამოიყენება ციკლების შექმნისშთვის ან უსასრულო ციკლების შექმნისთვის
