
#1)მომხარებელს შემოატანინეთ სტრინგი, შემდეგ დაპრინტეთ ეს სტრინგი დიდი ასოებით

user_input = input() # enter english text
print(user_input.upper())


#2)შექმენით სია სადაც შენიახავთ იმდენ სტრინგს, რამდენი მეთოდიც ისწავლეთ(რესურსები), და ყვეალ სტრინგზე გამოიყენეთ ყველა მეთოდი
#4)კომენტარების სახით ახსენით დღეს ნასწავლი თითოეული მეთოდი, და რას ნიშნავს რომ string არის immutable

strings = ["hello", "WORLD", "python", "house", "good morning"]


print(strings[0].upper())          
print(strings[1].lower())
print(strings[2].find("n"))
print(strings[3].replace("u", "r"))
print(strings[4].title())   


# .upper() ხდის ყველა სტრინგს დიდს
# .lower() - ხდის ყველა სტრინგს პატარას
# .find() - პოულობს მითითებული ნიშანს ან ასოს ან რიცხვს სტრინგში 
# .replace() - სტრინგში ყველა მითითებულ სიმბოლოს ან სიტყვას ან რიცხვს ცვლის სხვა სიმბოლოთი ან სიტყვით ან რიცხვით
# .title() ყოველი სიტყვის პირველ ასოს გაადიდებს
# .capitalize() მხოლოდ პირველ ასოს ადიდებს დანარჩენებს კი პატარას ხდის

# string არის immutable ნიშნავს რომ სტრინგის შეცვლა არ შეიძლება პირდაპირ
# 