
#1)შექმენით სია სადაც შეინახავთ 4 ელემენტს, შემდეგ მეორე ელემენტი შეცვალეთ "გურამი" თ



number = [1, 2, 3, 4]
number[1] = "გურამი"
print(number)



#2)შექმენით სია სადაც გექნებათ 3 სტრინგი და 3 ინტეჯერი, 
#ასევე შექმენით მეორე სია სადაც გექნებათ 2 ინტეჯერი, შემდეგ ეს ორი სია ერთმანეთს მიუმატეთ და დაპრინტეთ

list1 = ["good bye", "bye", "hello", 10, 20, 30]
list2 = [40, 50]

both = list1 + list2
print(both)

#3)შექმენი სია 15 ცალი ელემენტით, პირველი 5 იყოს სტრინგი და ეწეროს სააქართველოს ქალაქები, 
#მეორე 5ეული იყოს რიცხვები და ეწეროს თქვენი ოჯახის წევრების ასაკები(ან ნათესავების), მესამე 5ეული იყოს boolean ები(True False), 
#შემდეგ შექმენით სამი ცვლადი სადაც იქნება input და მომხარებელს შემოატანინეთ რაიმე მნიშვნელობა, 
#შემდგომ სიაში მე 4 ელემენტი მე 7 ელემენტი და მე 11 ელემენტი შეცვალეთ ამ სამი input ით

data = [
    "თბილისი", "ბათუმი", "ქუთაისი", "ზუგდიდი", "",  
    13, 18, 19, 44, 48,                                 
    True, False, True, False, True                      
]

inp1 = input("შეიყვანეთ პირველი მნიშვნელობა:")
inp2 = input("შეიყვანეთ მეორე მნიშვნელობა:")
inp3 = input("შეიყვანეთ მესამე მნიშვნელობა:")

data[4] = inp1   
data[7] = inp2   
data[11] = inp3  

print(data)

# 4)paint ში დახატე როგორ წარმოგიდგენია სია(list)
#ასე წარმოვიდგენ ლისტებს (ჰტმლ ის გამო რადგან მასე ასეთი იყო და ჩემი აზრითაც აქაც მსგავსი იქნება ამიტომ დავხატე ასე)