
#1)შექმენით ფუნქცია რომელიც დაპრინტავს "hello world", შემდეგ ეს ფუნქცია 10 ჯერ გამოიძახეთ

def hello():
    print("hello world")

for i in range(10):
    hello()


#2)კომენტარების სახით ახსენით რა არის არგუმენტი
# არგუმენტი არის ის ინფორმაცია ან მნიშვნელობა რომელსაც ფუნქციას ვაძლევთ როცა მისი გამოყენება გვინდა


#3)კომენტარების სახით ახსენით რაში გვჭირდება ფუნქცია
# ფუნქციას დახმარებით ჩვენ არ გვიწევს ერთიდაიგივე კოდის გამეორება და დაწერა რაც დაგვეხმარება კოდის ჩქარად დასაწერად


#4)შექმენით ფუნქცია რომელსაც გადაეცემა სახელი, შემდეგ f სტრინგით მიესალმეთ მომხარებელს

def გამარჯობა(name):
    print(f"გამარჯობა {name}")

გამარჯობა("ანდრია")