
# 1) for loop ის მეშვეობით გამოიტანე GOA BEST 1000 ჯერ

# 2) რისთვის გამოიყენება for loop ახსენი კომენტარებით, თუ ნახაზს დახატავთ უკეთესი იქნება

# 3) მომხმარებელს შემოატანინე რაიმე რიცხვი, შემდეგ for loop ში შემოტანილი რიცხვის მეშვეობით 
# უნდა გამოიტანოს GOA Best იმდენჯერ რასაც მომხმარებელი შეიყვანს

for i in range(1000):
    print(i, "GOA BEST!")

#---------------------------------------------------------

#loop -ი გამოიყენება ბევრი რაუდენობის რაღაცის ჩასაწერად ან დასანომრად რომ დავნომროთ მაგალითად ძალიან დიდი რეცეპთი და ასე შემდეგ
#ასევე შეიძლება მომხმარებელს ჩავაწერინოთ და მერე მათი ჩაწერილი დავპრინტოთ ბევრჯერ

#---------------------------------------------------------

print("enter any number")
for i in range (input()):
    print(i, "GOA BEST!!!")