
#3)მომხარებელს შემოატანინეთ 2 რიცხვი, თუ მეორე რიცხვი მეტია პრიველზე დაპრინტეთ "Level up", 
#და პირველი მეტია მეორეზე დაპრინტეთ "Level down", სხვა შემთხვევაში დაპრინტეთ "Level updown"

#4)კომენტარების სახით ახსენით if elif else და რა განსხვავებაა მათ შორის

num1 = int(input("შეიყვანეთ რიცხვი: "))
num2 = int(input("შეიყვანეთ რიცხვი მეორეჯერ: "))

if num2 > num1:
    print("level up")
elif num1 > num2:
    print("level down")
else:
    print("level updown")  


# if elif და else განსხვავება
# if გამოიყენება პირობის შესამოწმებლად თუ მოცემული ინფორმაცია მართალია შესრულდება კოდი
# elif გამოიყენება დამატებითი ინფორმაციის შესამოწმებლად თუ წინა ინფორმაცია არასწორი იყო 
# else გამოიყენება ყველა სხვა შემთხვევაში როცა არც ერთი if ან elif პირობა არის მცდარი