
#1))შექმენით სია სადაც იქნება 5 ცალი ელემენტი, ნებისმიერი, შემდეგ მომხარებელს შემოატანინეთ რამე რიცხვი, 
#თუ ეს რიცხვი იქნება სიის სიგრძეზე მეტი, მაშინ გამოაიტანოს "გურამი error", თუ არადა გამოიტანოს ამ სიაში ის ელემენტი 
#რომელიც მომხარებლის შემოტანილ ინდექსზე დგას 


mylist = ["crab", "dog", "giraffe", "lizard", "t-rex"]
number = int(input("შეიყვანე რიცხვი (0-დან 4-მდე): "))

if number < 0 or number > 4:
    print("გურამი error")
else:
    print(mylist[number])

#2)კომენტარებით ახსენით რა არის ინდექსინგი
# ინდექსინგი არის ის როცა სიაში ან სტრიქონში ელემენტებს ვპოულობთ მისი ნომრით და ჩავანაცვლოთ იგი სხვა სიტყვით ან რამე რისი ჩაწერაც გვსურს

#3)შექმენით სია სადაც შეინახავ 15 ცალ რიცვხს, შემდეგ დაპირნტეთ 10 ინდექსამდე ყველა ელემენტი slicing ით
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]
print(numbers[:10])

#4)სიაში შეინახეთ 5 ცალი სტრინგი, შემდეგ 2 იდან 4 მდე გამოიტანეთ ელემენტები
mylist2 = ["1", "2", "3", "4", "5"]
print(mylist2[2:4])

