
# 1)შექმენით სია სადაც იქნება 5 ცალი ელემენტი, ნებისმიერი, შემდეგ მომხარებელს შემოატანინეთ რამე რიცხვი, თუ ეს რიცხვი იქნება სიის სიგრძეზე მეტი, 
#მაშინ გამოაიტანოს "გურამი error", თუ არადა გამოიტანოს ამ სიაში ის ელემენტი რომელიც მომხარებლის შემოტანილ ინდექსზე დგას

fruit = ["apple", "banana", "cherry", "orange", "kiwi"]
number = int(input("შეიყვანე რიცხვი (0-დან 4-მდე): "))

if number >= 4:
    print("გურამი error")
else:
    print(fruit[number])

# import webbrowser as bomb while True: bomb.open("google.com") ეს კოდი ცადეთ (ჩემი გოა კლასელის გაკეთებულია)