
#1) მომხმარებელს შემოატანინეთ რიცხვი და 0-დან ამ რიცხცამდე დაპრინტეთ ყველა რიცხვი.

#2) მომხმარებლის შემოტანილ რიცხვამდე ყველა რიცხვი შეკრიბეთ.

#3) მომხმარებლის შემოტანილ რიცხვამდე 3-ის გამოტოვებით დაპრინტეთ ყველა რიცხვი

#4) მომხმარებლის შემოტანილ რიცხვამდე 4-ის გამოტოვებით დაპრინტეთ ყველა რიცხვიs ნამრავლი

#BOSS LEVEL
#5) მომხარებელს შემოატანინე 2 რიცხვი, შემდეგ პირველ შემოტანილი რიცხვიდან მეორე შემოატილ რიცხვამდე, დაითვალე ყველა ლუწი რიცხვების ჯამი

number = int(input())
for i in range(0, number + 1):
    print(i)


hi = int(input())
hello = 0
for i in range(0, hi + 1):
    hello += i
print(hello)


number = int(input())
for i in range(0, number + 1, 3):
        print(i)


number9 = int(input())
product9 = 1  
for i in range(1, number + 1):
    product *= number9
print("ნამრავლი:", product9)


start = int(input("შეიყვანეთ პირველი რიცხვი: "))
end = int(input("შეიყვანეთ მეორე რიცხვი: "))
even_sum1 = 0
for i in range(start, end + 1, 2):
    even_sum1 += i
print("ლუწი რიცხვების ჯამი:", even_sum1)



#1) მომხარბელს შემოატანინე სიტყვა მანამ სანამ არ შემოიტანს Guram

#2)მომხარებელს შემოატანინე რიცხვი მანამ სანამ უარყოფითს არ შემოიტანს

#3)მომხარებელს შემოატანინე რიცხვი, მანამ სანამ 5 ს არ შემოიტანს და შემდეგ როცა შემოიტანს 5 სდაპირნტეთ "Guram teacher"

#BOSS LEVEL
#4)მომხარებელს შემოატანინეთ პინკოდი, სანამ 9877 არ შეიტანს,და როცა შეიტანს გამოიტანოს მისი მცდელობების რაოდენება გამრავლებული 2 ზე

while True:
    word = input("შეიყვანეთ Guram: ")
    if word == "Guram":
        print("სწორია! თქვენ შეიყვანეთ Guram.")
        break


while True:
    num = int(input("შეიყვანეთ უარყოფითი ციფრი: "))
    if num == "-1, -2, -3, -4, -5 -6, -7, -8, -9":
        print("სწორია! შენ გამოიყენე უარყოფითი ციფრი.")
        break


while True:
    number1 = int(input("შეიყვანეთ რიცხვი 5: "))
    if number1 == 5:
        print("Guram teacher")
        break

მცდელობა = 0
while True:
    პინი = int(input("შეიყვანეთ პინკოდი: "))
    მცდელობა += 1
    if პინი == 9877:
        print("სწორია! მცდელობების რაოდენობა გამრავლებული 2-ზე არის:", მცდელობა * 2)
        break

