
#3)შექმენი სია 15 ცალი ელემენტით, პირველი 5 იყოს სტრინგი და ეწეროს სააქართველოს ქალაქები, 
#მეორე 5ეული იყოს რიცხვები და ეწეროს თქვენი ოჯახის წევრების ასაკები(ან ნათესავების), მესამე 5ეული იყოს boolean ები(True False),
#შემდეგ შექმენით სამი ცვლადი სადაც იქნება input და მომხარებელს შემოატანინეთ რაიმე მნიშვნელობა, 
#შემდგომ სიაში მე 4 ელემენტი მე 7 ელემენტი და მე 11 ელემენტი შეცვალეთ ამ სამი input ით


data = ["თბილისი", "ბათუმი", "ქუთაისი", "ზუგდიდი", "გორი", 13, 18, 19, 43, 45, True, False, True, False, True]

input1 = input("შეიყვანეთ მნიშვნელობა: ")
input2 = input("შეიყვანეთ მნიშვნელობა: ")
input3 = input("შეიყვანეთ მნიშვნელობა: ")

data[4] = input1  
data[7] = input2  
data[11] = input3  

print("სია:", data)