
#1)შექმენით 4 ცალი ცვლადი საიდან შენახავთ ტრინგერბს, პირველი სტრინგ დაპრინტეთ ყველა ასო დაპატარავებული, მეორე ყველა ასო გადიდებული,
# მესამე პირველი ასო გადიდებული მარტო, და მეოთხეში ყველა a ასო შეცვალეთ b თი(დაიხმარეთ რესურები)

str1 = "Hello World"
str2 = "Python"
str3 = "apple"
str4 = "banana"

print(str1.lower())
print(str2.upper())
print(str3.capitalize()) 
print(str4.replace("a", "b"))

#2)შექმენით ცვლადი რომელშიც შეინახავთ სიას, 5 ცალი ელემენტით, პირველი ელემენტი დაპრინტეთ გადიდებული,
#მეორე ელემენტი დაპრინტეთ დაპატარავებული, მესამე ელემენტში იპოვეთ ასო "n", 
#მეოთხე ელემენტში ასო "g" შეცვალეთ ასო "k" თი, მეხუთე ელემენტში კი ყველა სიტყვის პირველი ასო იყოს დიდი


my_list = ["hello", "WORLD", "python", "programming", "hi teacher"]

print(my_list[0].upper())
print(my_list[1].lower())
print(my_list[2].find("n"))
print(my_list[3].replace("g", "k"))
print(my_list[4].title())