
#1) შექმენი for loop, for loop მა უნდა გამოიტანოს 1 დან 10 მდე მხოლოდ კენტი რიცხვები, ასევე ახსენი რა არის range რა არის step  და რა არის საიტერაციო ცვლადი

for i in range(1,10,2):
    print(i)

#range არის იგივე დიაპაზონი ანუ რიცხვების თანმიმდევრობა არჩეულ რიცხვიდან დასასრულამდე

#step არის ნაბიჯი ანუ წინ წასვლა პითონში

#საიტერაციო ცვლადი არის გამეორება და მაში უკვე არის კოდი ჩაწერილი


#---------------------------------------------------------------------------------------

#2) შექმენით for loop, for loop ის მეშვეობით გამოიტანე 100 ჯერ GOA Best! ოღონდ ისე რომ მარცხნივ შეგეძლოს წაიკითხო მერამდენე GOA Best! არის , მაგ: 21 GOA 

for i in range(100):
    print(i, "GOA Best!")

#---------------------------------------------------------------------------------------

#3) მომხამრებელს შემოატანინეთ 10 რიცხვი ნებისმიერი რიცხვი input ების მეშვეობით და გამოიყენე for loop-ი


for i in range(10):
    print(i, input("enter any number"))
    